In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [5]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

In [7]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [9]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male  female  male
0       3    male  22.0   7.2500       0     1       0     1
1       1  female  38.0  71.2833       1     0       1     0
2       3  female  26.0   7.9250       1     0       1     0

In [10]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male  female  male
0       3  22.0   7.2500       0     1       0     1
1       1  38.0  71.2833       1     0       1     0
2       3  26.0   7.9250       1     0       1     0

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [15]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male  female  male
0       3  22.000000   7.2500       0     1       0     1
1       1  38.000000  71.2833       1     0       1     0
2       3  26.000000   7.9250       1     0       1     0
3       1  35.000000  53.1000       1     0       1     0
4       3  35.000000   8.0500       0     1       0     1
5       3  29.699118   8.4583       0     1       0     1

In [18]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [19]:
len(X_train)

712

In [20]:
len(X_test)

179

In [21]:
len(inputs)

891

In [22]:
X_train

     Pclass   Age      Fare  female  male  female  male
165       3   9.0   20.5250       0     1       0     1
216       3  27.0    7.9250       1     0       1     0
257       1  30.0   86.5000       1     0       1     0
498       1  25.0  151.5500       1     0       1     0
6         1  54.0   51.8625       0     1       0     1
..      ...   ...       ...     ...   ...     ...   ...
458       2  50.0   10.5000       1     0       1     0
255       3  29.0   15.2458       1     0       1     0
344       2  36.0   13.0000       0     1       0     1
797       3  31.0    8.6833       1     0       1     0
453       1  49.0   89.1042       0     1       0     1

[712 rows x 7 columns]

In [23]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [24]:
model.fit(X_train,y_train)

GaussianNB()

In [25]:
model.score(X_test,y_test)

0.7821229050279329

In [26]:
X_test[:10]

     Pclass        Age     Fare  female  male  female  male
145       2  19.000000  36.7500       0     1       0     1
290       1  26.000000  78.8500       1     0       1     0
182       3   9.000000  31.3875       0     1       0     1
851       3  74.000000   7.7750       0     1       0     1
773       3  29.699118   7.2250       0     1       0     1
641       1  24.000000  69.3000       1     0       1     0
724       1  27.000000  53.1000       0     1       0     1
403       3  28.000000  15.8500       0     1       0     1
402       3  21.000000   9.8250       1     0       1     0
73        3  26.000000  14.4542       0     1       0     1

In [27]:
y_test[:10]

145    0
290    1
182    0
851    0
773    0
641    1
724    1
403    0
402    0
73     0
Name: Survived, dtype: int64

In [28]:
model.predict(X_test[:10])

array([0, 1, 0, 0, 0, 1, 0, 0, 1, 0], dtype=int64)

In [30]:
model.predict_proba(X_test[:10])

array([[9.97618698e-01, 2.38130182e-03],
       [2.23918842e-05, 9.99977608e-01],
       [9.98683801e-01, 1.31619948e-03],
       [9.98173934e-01, 1.82606614e-03],
       [9.99277571e-01, 7.22429148e-04],
       [3.35820811e-05, 9.99966418e-01],
       [9.88966063e-01, 1.10339367e-02],
       [9.99281028e-01, 7.18972054e-04],
       [8.54164867e-04, 9.99145835e-01],
       [9.99260044e-01, 7.39956164e-04]])